Autodesk.Revit.DB.Electrical.LoadClassificationType
An enumerated type listing all the possible load classification types for a connector object.

Autodesk.Revit.DB.Electrical.LoadClassificationType.HVAC
Load Classification Type is HVAC.

Autodesk.Revit.DB.Electrical.LoadClassificationType.Lighting
Load Classification Type is Lighting.

Autodesk.Revit.DB.Electrical.LoadClassificationType.Power
Load Classification Type is Power.

Autodesk.Revit.DB.Electrical.LoadClassificationType.Other
Load Classification Type is Other.